Identifier: local.jss.AdobeReaderDC
Input:
  CATEGORY: Manifests
  ENABLED: 'True'
  GROUP: Prod
  GROUP_NAME: Managed-Install-%SOFTWARETITLE%
  GROUP_TEMPLATE: 'SmartGroupTemplate_ManagedInstalls.xml'
  MESSAGE_FINISH: '%NAME% Has just finished installing.'
  POLICY_CATEGORY: Manifests
  POLICY_TEMPLATE: 'PolicyTemplate_ManagedInstalls.xml'
  NAME: AdobeReader DC
  SOFTWARETITLE: AdobeReaderDC
  VENDOR: Adobe
ParentRecipe: com.github.autopkg.pkg.AdobeReaderDC
Process:
- Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
  Comment: creates group for Update-Smart-Chrome, creates policy trigger only for install-latest-Chrome
  Processor: JSSImporter
