Identifier: local.jss.DriveFS
Input:
  CATEGORY: Manifests
  ENABELED: 'False'
  GROUP: Prod
  GROUP_NAME: Managed-Install-%SOFTWARETITLE%
  GROUP_TEMPLATE: 'SmartGroupTemplate_ManagedInstalls.xml'
  MESSAGE_FINISH: '%NAME% Has just finished installing.'
  POLICY_CATEGORY: Manifests
  POLICY_TEMPLATE: 'PolicyTemplate_ManagedInstalls.xml'
  NAME: DriveFS
  SOFTWARETITLE: DriveFS
  VENDOR: DriveFS
  OS_REQUIREMENTS: 10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x,10.9.x
  RELEASE: latest
MinimumVersion: 1.0.4
ParentRecipe: com.github.crystalllized.pkg.googledrivefs
Process:
- Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
  Processor: JSSImporter
