Identifier: local.jss.MicrosoftExcel365
Input:
  CATEGORY: Manifests
  ENABLED: 'True'
  GROUP: Prod
  GROUP_NAME: Managed-Install-%SOFTWARETITLE%
  GROUP_TEMPLATE: 'SmartGroupTemplate_ManagedInstalls.xml'
  POLICY_CATEGORY: Manifests
  POLICY_TEMPLATE: 'PolicyTemplate_ManagedInstalls.xml'
  NAME: Microsoft Excel
  PRODUCTID: '525135'
  SOFTWARETITLE: Excel
  VENDOR: Microsoft
ParentRecipe: com.github.rtrouton.pkg.microsoftexcel365
Process:
- Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
  Processor: JSSImporter
