Identifier: local.jss.Zeplin
Input:
  CATEGORY: Manifests
  ENABLED: 'True'
  GROUP: Prod
  GROUP_NAME: Managed-Install-%SOFTWARETITLE%
  GROUP_TEMPLATE: 'SmartGroupTemplate_ManagedInstalls.xml'
  POLICY_CATEGORY: Manifests
  POLICY_TEMPLATE: 'PolicyTemplate_ManagedInstalls.xml'
  LOCALE: en-US
  NAME: Zeplin
  OS_REQUIREMENTS: 10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x,10.9.x
  RELEASE: latest
  SOFTWARETITLE: Zeplin
  SPARKLE_FEED_URL: https://rink.hockeyapp.net/api/2/apps/8926efffe734b6d303d09f41d90c34fc
  SOFTWARETITLE: Zeplin
ParentRecipe: com.github.hobbithardcase.pkg.Zeplin
MinimumVersion: 1.0.4
Process:
- Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
  Processor: JSSImporter
